In [2]:
import pandas as pd

In [3]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana'],
        'Marks':[98,89,99,87,90,83,99],
        'Gender':['Male','Female','Female','Male','Male','Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [5]:
df1.head(3) #display top  3 rows of the dataset

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

In [6]:
df1.tail(3) #display last 3 rows of the dataset

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [7]:
df1.shape #display shape of the dataset (No of rows, No of columns), shape is not a method, it is an attribute of pandas dataframe

(7, 3)

In [9]:
print("No of rows", df1.shape[0]) #To display no of rows
print("No of columns", df1.shape[1]) #To display no of columns

No of rows 7
No of columns 3

In [10]:
df1.info() #information about the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [12]:
df1.isnull().sum() #to check the null values in the dataset

Name      0
Marks     0
Gender    0
dtype: int64

In [13]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [14]:
df1.describe() #displays the overall statistics of numerical columns only

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [15]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [17]:
df1['Gender'].unique() #displays unique values from gender column

array(['Male', 'Female'], dtype=object)

In [18]:
df1['Gender'].nunique() #no of unique values from gender column

2

In [19]:
df1['Gender'].value_counts() #count of unique values in gender column

Female    4
Male      3
Name: Gender, dtype: int64

In [21]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [23]:
df1[(df1['Marks']>=90)  & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [24]:
len(df1[(df1['Marks']>=90)  & (df1['Marks']<=100)])

4

In [25]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [26]:
sum(df1['Marks'].between(90,100)) #use of pandas between method

4

In [27]:
df1['Marks'].mean() #average

92.14285714285714

In [28]:
df1['Marks'].min() #minimum value

83

In [29]:
df1['Marks'].max() #maximum value

99

In [30]:
def marks():
    return x/s

In [31]:
df1['Marks'].apply(marks) #use of app;y method

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [35]:
df1['Half'] = df1['Marks'].apply(marks)

In [36]:
df1

      Name  Marks  Gender  Half
0  Priyang     98    Male  49.0
1   Aadhya     89  Female  44.5
2   Krisha     99  Female  49.5
3   Vedant     87    Male  43.5
4   Parshv     90    Male  45.0
5   Mittal     83  Female  41.5
6  Archana     99  Female  49.5

In [37]:
df1['Half_lambda'] = df1['Marks'].apply(lambda x:x//2) #use of lambda function

In [38]:
df1

      Name  Marks  Gender  Half  Half_lambda
0  Priyang     98    Male  49.0           49
1   Aadhya     89  Female  44.5           44
2   Krisha     99  Female  49.5           49
3   Vedant     87    Male  43.5           43
4   Parshv     90    Male  45.0           45
5   Mittal     83  Female  41.5           41
6  Archana     99  Female  49.5           49

In [39]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [42]:
df1['Male_Female'] = df1['Gender'].map({'Male':1, 'Female':0}) #use of map function
df1

      Name  Marks  Gender  Half  Half_lambda  Male_Female
0  Priyang     98    Male  49.0           49            1
1   Aadhya     89  Female  44.5           44            0
2   Krisha     99  Female  49.5           49            0
3   Vedant     87    Male  43.5           43            1
4   Parshv     90    Male  45.0           45            1
5   Mittal     83  Female  41.5           41            0
6  Archana     99  Female  49.5           49            0

In [43]:
df1.drop('Male_Female', axis=1)

      Name  Marks  Gender  Half  Half_lambda
0  Priyang     98    Male  49.0           49
1   Aadhya     89  Female  44.5           44
2   Krisha     99  Female  49.5           49
3   Vedant     87    Male  43.5           43
4   Parshv     90    Male  45.0           45
5   Mittal     83  Female  41.5           41
6  Archana     99  Female  49.5           49

In [45]:
df1.drop(['Male_Female', 'Half_lambda'], axis=1, inplace=True)

In [46]:
df1

      Name  Marks  Gender  Half
0  Priyang     98    Male  49.0
1   Aadhya     89  Female  44.5
2   Krisha     99  Female  49.5
3   Vedant     87    Male  43.5
4   Parshv     90    Male  45.0
5   Mittal     83  Female  41.5
6  Archana     99  Female  49.5

In [47]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half'], dtype='object')

In [48]:
df1.index

RangeIndex(start=0, stop=7, step=1)

In [49]:
df1.sort_values(by='Marks')

      Name  Marks  Gender  Half
5   Mittal     83  Female  41.5
3   Vedant     87    Male  43.5
1   Aadhya     89  Female  44.5
4   Parshv     90    Male  45.0
0  Priyang     98    Male  49.0
2   Krisha     99  Female  49.5
6  Archana     99  Female  49.5

In [50]:
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender  Half
2   Krisha     99  Female  49.5
6  Archana     99  Female  49.5
0  Priyang     98    Male  49.0
4   Parshv     90    Male  45.0
1   Aadhya     89  Female  44.5
3   Vedant     87    Male  43.5
5   Mittal     83  Female  41.5

In [54]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99